Python 3.12.2 (tags/v3.12.2:6abddd9, Feb  6 2024, 21:26:36) [MSC v.1937 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> 필수과제1
... - 튜플을 이용해서 in, not in 확인하기
... - 시퀀스 객체 연결해 보기!
... - 시퀀스 객체를 연결하면 시퀀스 + 시퀀스는 연결 가능
... - 시퀀스 * N n만큼 연결
... - 하지만 시퀀스에 +1 에서 요소값을 더하는 것 예를 들어 [1,2,3] +1 = [2,3,4] 나올 것 같지만 불가하다. *2 불가 나누기도 불가
SyntaxError: multiple statements found while compiling a single statement
>>> 
>>> tuple(range(10))
(0, 1, 2, 3, 4, 5, 6, 7, 8, 9)
>>> 11 in range(10)
False
>>> 3 in range(10)
True
>>> '안녕하세요' in ['안녕하세요.','네']
False
>>> a=[1,10,100]
>>> b=[1000,10000,100000]
>>> print(a)
[1, 10, 100]
>>> print(b)
[1000, 10000, 100000]
>>> a+b
[1, 10, 100, 1000, 10000, 100000]
>>> b+a
[1000, 10000, 100000, 1, 10, 100]
>>> a*3
[1, 10, 100, 1, 10, 100, 1, 10, 100]
>>> (a+b)*2
[1, 10, 100, 1000, 10000, 100000, 1, 10, 100, 1000, 10000, 100000]
